# ElectricalEquipment Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalEquipment Class
Members See Also
---
Provides access to the Electrical Equipment in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class ElectricalEquipment : MEPModel
```

Visual Basic
---
```text
Public Class ElectricalEquipment _
	Inherits MEPModel
```

Visual C++
---
```text
public ref class ElectricalEquipment : public MEPModel
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..MEPModel Autodesk.Revit.DB.Electrical..::..ElectricalEquipment
# See Also
ElectricalEquipment Members
Autodesk.Revit.DB.Electrical Namespace